Jutenbezbuten/wzpsw/RTOS/FreeRTOSv202104.00/4.1.1.3/Demo/ARM7_LPC2129_Keil_RVDS/led.c
#include <LPC21xx.H>
#include "led.h"

#define LED0_bm 1<<16
#define LED1_bm 1<<17
#define LED2_bm 1<<18
#define LED3_bm 1<<19

void LedInit (void){
	IO1DIR=IO1DIR|(LED0_bm|LED1_bm|LED2_bm|LED3_bm);
	IO1SET=LED0_bm;
}

void LedOn(unsigned char ucLedIndeks){
	IO1CLR=LED0_bm|LED1_bm|LED2_bm|LED3_bm;
	switch(ucLedIndeks){
		case 0:
			IO1SET=LED0_bm;
			break;
		case 1:
			IO1SET=LED1_bm;
			break;
		case 2:
			IO1SET=LED2_bm;
			break;
		case 3:
			IO1SET=LED3_bm;
			break;
		default:
			break;
	}
}

void Led_Step(enum Step Direction){
	static unsigned int uiDioda;
	
	if (Direction==LEFT){
		uiDioda++;
	}
	else {
		uiDioda--;
	}
	LedOn(uiDioda%4);
}

void Led_StepLeft(void){
		Led_Step(LEFT);
}

void Led_StepRight(void){
		Led_Step(RIGHT);
}

void Led_Toggle(unsigned char ucLedIndeks){
	unsigned long ulCurrentState;
	unsigned long ulLedPosition = ((LED0_bm)<<ucLedIndeks);

	ulCurrentState = IO1PIN;

	if(ulCurrentState & ulLedPosition){
		IO1CLR = ulLedPosition;
	}
	else{
		IO1SET = ulLedPosition;			
	}
}

void Led_Set(unsigned char ucLedIndeks)
{
	IO1SET = ((LED0_bm)<<ucLedIndeks);			
}

void Led_Clear(unsigned char ucLedIndeks)
{
	IO1CLR = ((LED0_bm)<<ucLedIndeks);			
}
